alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/atdf/ATSAML21E17B.atdf
          <instance name="TCC2">
            <register-group name="TCC2" name-in-module="TCC" address-space="base" offset="0x42001C00"/>
            <signals>
              <signal group="WO" index="0" function="E" pad="PA16"/>
              <signal group="WO" index="0" function="E" pad="PA00"/>
              <signal group="WO" index="1" function="E" pad="PA17"/>
              <signal group="WO" index="1" function="E" pad="PA01"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2"/>
              <param name="DITHERING" value="0"/>
              <param name="DMAC_ID_OVF" value="19"/>
              <param name="DTI" value="0"/>
              <param name="EXT" value="0"/>
              <param name="GCLK_ID" value="26"/>
              <param name="OTMX" value="0"/>
              <param name="OW_NUM" value="2"/>
              <param name="PG" value="0"/>
              <param name="SIZE" value="16"/>
              <param name="SWAP" value="0"/>
              <param name="TYPE" value="0"/>
              <param name="INSTANCE_ID" value="71"/>
            </parameters>
          </instance>
        </module>
        <module name="TRNG" id="U2242" version="1.0.0">
          <instance name="TRNG">
            <register-group name="TRNG" name-in-module="TRNG" address-space="base" offset="0x42003800"/>
            <parameters>
              <param name="INSTANCE_ID" value="78"/>
            </parameters>
          </instance>
        </module>
        <module name="USB" id="U2222" version="1.1.1">
          <instance name="USB">
            <register-group name="USB" name-in-module="USB" address-space="base" offset="0x41000000"/>
            <signals>
              <signal group="DM" function="G" pad="PA24"/>
              <signal group="DP" function="G" pad="PA25"/>
              <signal group="SOF_1KHZ" function="G" pad="PA23"/>
            </signals>
            <parameters>
              <param name="EPT_NBR" value="8"/>
              <param name="EPT_NUM" value="8"/>
              <param name="GCLK_ID" value="4"/>
              <param name="PIPE_NUM" value="8"/>
              <param name="INSTANCE_ID" value="32"/>
            </parameters>
          </instance>
        </module>
        <module name="WDT" id="U2251" version="1.0.1">
          <instance name="WDT">
            <register-group name="WDT" name-in-module="WDT" address-space="base" offset="0x40001C00"/>
            <parameters>
              <param name="INSTANCE_ID" value="7"/>
            </parameters>
          </instance>
        </module>
        <module name="NVIC" version="1.0.0">
          <instance name="NVIC">
            <register-group name="NVIC" name-in-module="NVIC" address-space="base" offset="0xE000E100"/>
            <parameters>
              <param name="NUM_IRQ" value="29"/>
              <param name="__NVIC_PRIO_BITS" value="2"/>
            </parameters>
          </instance>
        </module>
        <module name="SysTick" version="1.0.0">
          <instance name="SysTick">
            <register-group name="SysTick" name-in-module="SysTick" address-space="base" offset="0xE000E010"/>
          </instance>
        </module>
        <module name="SystemControl" version="1.0.0">
          <instance name="SystemControl">
            <register-group name="SystemControl" name-in-module="SystemControl" address-space="base" offset="0xE000E000"/>
            <parameters>
              <param name="__VTOR_PRESENT" value="1"/>
            </parameters>
          </instance>
        </module>
      </peripherals>
      <interrupts>
        <interrupt name="NonMaskableInt" index="-14" caption="Non Maskable Interrupt"/>
        <interrupt name="HardFault" index="-13" caption="Cortex-M0+ Hard Fault Interrupt"/>
        <interrupt name="SVCall" index="-5" caption="Cortex-M0+ SV Call Interrupt"/>
        <interrupt name="PendSV" index="-2" caption="Cortex-M0+ Pend SV Interrupt"/>
        <interrupt name="SysTick" index="-1" caption="Cortex-M0+ System Tick Interrupt"/>
        <interrupt name="SYSTEM" index="0" module-instance="MCLK OSCCTRL OSC32KCTRL PAC PM SUPC"/>
        <interrupt name="WDT" index="1" module-instance="WDT"/>
        <interrupt name="RTC" index="2" module-instance="RTC"/>
        <interrupt name="EIC" index="3" module-instance="EIC"/>
        <interrupt name="NVMCTRL" index="4" module-instance="NVMCTRL"/>
        <interrupt name="DMAC" index="5" module-instance="DMAC"/>
        <interrupt name="USB" index="6" module-instance="USB"/>
        <interrupt name="EVSYS" index="7" module-instance="EVSYS"/>
        <interrupt name="SERCOM0" index="8" module-instance="SERCOM0"/>
        <interrupt name="SERCOM1" index="9" module-instance="SERCOM1"/>
        <interrupt name="SERCOM2" index="10" module-instance="SERCOM2"/>
        <interrupt name="SERCOM3" index="11" module-instance="SERCOM3"/>
        <interrupt name="SERCOM4" index="12" module-instance="SERCOM4"/>
        <interrupt name="SERCOM5" index="13" module-instance="SERCOM5"/>
        <interrupt name="TCC0" index="14" module-instance="TCC0"/>
        <interrupt name="TCC1" index="15" module-instance="TCC1"/>
        <interrupt name="TCC2" index="16" module-instance="TCC2"/>
        <interrupt name="TC0" index="17" module-instance="TC0"/>
        <interrupt name="TC1" index="18" module-instance="TC1"/>
        <interrupt name="TC4" index="21" module-instance="TC4"/>
        <interrupt name="ADC" index="22" module-instance="ADC"/>
        <interrupt name="AC" index="23" module-instance="AC"/>
        <interrupt name="DAC" index="24" module-instance="DAC"/>
        <interrupt name="PTC" index="25" module-instance="PTC"/>
        <interrupt name="AES" index="26" module-instance="AES"/>
        <interrupt name="TRNG" index="27" module-instance="TRNG"/>
      </interrupts>
      <interfaces>
        <interface name="SWD" type="swd"/>
      </interfaces>
      <property-groups>
        <property-group name="SIGNATURES">
          <property name="DSU_DID" value="0x1081021A"/>
        </property-group>
      </property-groups>
    </device>
  </devices>
  <modules>
    <module name="AC" id="U2245" version="1.0.1" caption="Analog Comparators">
      <register-group name="AC" caption="Analog Comparators">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
        </register>
