alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/atdf/ATSAML21E17B.atdf
        <register name="PRICTRL0" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Priority Control 0">
          <bitfield name="LVLPRI0" caption="Level 0 Channel Priority Number" mask="0xF"/>
          <bitfield name="RRLVLEN0" caption="Level 0 Round-Robin Scheduling Enable" mask="0x80"/>
          <bitfield name="LVLPRI1" caption="Level 1 Channel Priority Number" mask="0xF00"/>
          <bitfield name="RRLVLEN1" caption="Level 1 Round-Robin Scheduling Enable" mask="0x8000"/>
          <bitfield name="LVLPRI2" caption="Level 2 Channel Priority Number" mask="0xF0000"/>
          <bitfield name="RRLVLEN2" caption="Level 2 Round-Robin Scheduling Enable" mask="0x800000"/>
          <bitfield name="LVLPRI3" caption="Level 3 Channel Priority Number" mask="0xF000000"/>
          <bitfield name="RRLVLEN3" caption="Level 3 Round-Robin Scheduling Enable" mask="0x80000000"/>
        </register>
        <register name="INTPEND" offset="0x20" rw="RW" size="2" initval="0x0000" caption="Interrupt Pending">
          <bitfield name="ID" caption="Channel ID" mask="0xF"/>
          <bitfield name="TERR" caption="Transfer Error" mask="0x100"/>
          <bitfield name="TCMPL" caption="Transfer Complete" mask="0x200"/>
          <bitfield name="SUSP" caption="Channel Suspend" mask="0x400"/>
          <bitfield name="FERR" caption="Fetch Error" mask="0x2000"/>
          <bitfield name="BUSY" caption="Busy" mask="0x4000"/>
          <bitfield name="PEND" caption="Pending" mask="0x8000"/>
        </register>
        <register name="INTSTATUS" offset="0x24" rw="R" size="4" initval="0x00000000" caption="Interrupt Status">
          <bitfield name="CHINT0" caption="Channel 0 Pending Interrupt" mask="0x1"/>
          <bitfield name="CHINT1" caption="Channel 1 Pending Interrupt" mask="0x2"/>
          <bitfield name="CHINT2" caption="Channel 2 Pending Interrupt" mask="0x4"/>
          <bitfield name="CHINT3" caption="Channel 3 Pending Interrupt" mask="0x8"/>
          <bitfield name="CHINT4" caption="Channel 4 Pending Interrupt" mask="0x10"/>
          <bitfield name="CHINT5" caption="Channel 5 Pending Interrupt" mask="0x20"/>
          <bitfield name="CHINT6" caption="Channel 6 Pending Interrupt" mask="0x40"/>
          <bitfield name="CHINT7" caption="Channel 7 Pending Interrupt" mask="0x80"/>
          <bitfield name="CHINT8" caption="Channel 8 Pending Interrupt" mask="0x100"/>
          <bitfield name="CHINT9" caption="Channel 9 Pending Interrupt" mask="0x200"/>
          <bitfield name="CHINT10" caption="Channel 10 Pending Interrupt" mask="0x400"/>
          <bitfield name="CHINT11" caption="Channel 11 Pending Interrupt" mask="0x800"/>
          <bitfield name="CHINT12" caption="Channel 12 Pending Interrupt" mask="0x1000"/>
          <bitfield name="CHINT13" caption="Channel 13 Pending Interrupt" mask="0x2000"/>
          <bitfield name="CHINT14" caption="Channel 14 Pending Interrupt" mask="0x4000"/>
          <bitfield name="CHINT15" caption="Channel 15 Pending Interrupt" mask="0x8000"/>
        </register>
        <register name="BUSYCH" offset="0x28" rw="R" size="4" initval="0x00000000" caption="Busy Channels">
          <bitfield name="BUSYCH0" caption="Busy Channel 0" mask="0x1"/>
          <bitfield name="BUSYCH1" caption="Busy Channel 1" mask="0x2"/>
          <bitfield name="BUSYCH2" caption="Busy Channel 2" mask="0x4"/>
          <bitfield name="BUSYCH3" caption="Busy Channel 3" mask="0x8"/>
          <bitfield name="BUSYCH4" caption="Busy Channel 4" mask="0x10"/>
          <bitfield name="BUSYCH5" caption="Busy Channel 5" mask="0x20"/>
          <bitfield name="BUSYCH6" caption="Busy Channel 6" mask="0x40"/>
          <bitfield name="BUSYCH7" caption="Busy Channel 7" mask="0x80"/>
          <bitfield name="BUSYCH8" caption="Busy Channel 8" mask="0x100"/>
          <bitfield name="BUSYCH9" caption="Busy Channel 9" mask="0x200"/>
          <bitfield name="BUSYCH10" caption="Busy Channel 10" mask="0x400"/>
          <bitfield name="BUSYCH11" caption="Busy Channel 11" mask="0x800"/>
          <bitfield name="BUSYCH12" caption="Busy Channel 12" mask="0x1000"/>
          <bitfield name="BUSYCH13" caption="Busy Channel 13" mask="0x2000"/>
          <bitfield name="BUSYCH14" caption="Busy Channel 14" mask="0x4000"/>
          <bitfield name="BUSYCH15" caption="Busy Channel 15" mask="0x8000"/>
        </register>
        <register name="PENDCH" offset="0x2C" rw="R" size="4" initval="0x00000000" caption="Pending Channels">
          <bitfield name="PENDCH0" caption="Pending Channel 0" mask="0x1"/>
          <bitfield name="PENDCH1" caption="Pending Channel 1" mask="0x2"/>
          <bitfield name="PENDCH2" caption="Pending Channel 2" mask="0x4"/>
          <bitfield name="PENDCH3" caption="Pending Channel 3" mask="0x8"/>
          <bitfield name="PENDCH4" caption="Pending Channel 4" mask="0x10"/>
          <bitfield name="PENDCH5" caption="Pending Channel 5" mask="0x20"/>
          <bitfield name="PENDCH6" caption="Pending Channel 6" mask="0x40"/>
          <bitfield name="PENDCH7" caption="Pending Channel 7" mask="0x80"/>
          <bitfield name="PENDCH8" caption="Pending Channel 8" mask="0x100"/>
          <bitfield name="PENDCH9" caption="Pending Channel 9" mask="0x200"/>
          <bitfield name="PENDCH10" caption="Pending Channel 10" mask="0x400"/>
          <bitfield name="PENDCH11" caption="Pending Channel 11" mask="0x800"/>
          <bitfield name="PENDCH12" caption="Pending Channel 12" mask="0x1000"/>
          <bitfield name="PENDCH13" caption="Pending Channel 13" mask="0x2000"/>
          <bitfield name="PENDCH14" caption="Pending Channel 14" mask="0x4000"/>
          <bitfield name="PENDCH15" caption="Pending Channel 15" mask="0x8000"/>
        </register>
        <register name="ACTIVE" offset="0x30" rw="R" size="4" initval="0x00000000" caption="Active Channel and Levels">
          <bitfield name="LVLEX0" caption="Level 0 Channel Trigger Request Executing" mask="0x1"/>
          <bitfield name="LVLEX1" caption="Level 1 Channel Trigger Request Executing" mask="0x2"/>
          <bitfield name="LVLEX2" caption="Level 2 Channel Trigger Request Executing" mask="0x4"/>
          <bitfield name="LVLEX3" caption="Level 3 Channel Trigger Request Executing" mask="0x8"/>
          <bitfield name="ID" caption="Active Channel ID" mask="0x1F00"/>
          <bitfield name="ABUSY" caption="Active Channel Busy" mask="0x8000"/>
          <bitfield name="BTCNT" caption="Active Channel Block Transfer Count" mask="0xFFFF0000"/>
        </register>
        <register name="BASEADDR" offset="0x34" rw="RW" size="4" initval="0x00000000" caption="Descriptor Memory Section Base Address">
          <bitfield name="BASEADDR" caption="Descriptor Memory Base Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="WRBADDR" offset="0x38" rw="RW" size="4" initval="0x00000000" caption="Write-Back Memory Section Base Address">
          <bitfield name="WRBADDR" caption="Write-Back Memory Base Address" mask="0xFFFFFFFF"/>
        </register>
        <register name="CHID" offset="0x3F" rw="RW" size="1" initval="0x00" caption="Channel ID">
          <bitfield name="ID" caption="Channel ID" mask="0xF"/>
        </register>
        <register name="CHCTRLA" offset="0x40" rw="RW" size="1" initval="0x00" caption="Channel Control A">
          <bitfield name="SWRST" caption="Channel Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Channel Enable" mask="0x2"/>
          <bitfield name="RUNSTDBY" caption="Channel run in standby" mask="0x40"/>
        </register>
        <register name="CHCTRLB" offset="0x44" rw="RW" size="4" initval="0x00000000" caption="Channel Control B">
          <bitfield name="EVACT" caption="Event Input Action" mask="0x7" values="DMAC_CHCTRLB__EVACT"/>
          <bitfield name="EVIE" caption="Channel Event Input Enable" mask="0x8"/>
          <bitfield name="EVOE" caption="Channel Event Output Enable" mask="0x10"/>
          <bitfield name="LVL" caption="Channel Arbitration Level" mask="0x60"/>
          <bitfield name="TRIGSRC" caption="Trigger Source" mask="0x3F00" values="DMAC_CHCTRLB__TRIGSRC"/>
          <bitfield name="TRIGACT" caption="Trigger Action" mask="0xC00000" values="DMAC_CHCTRLB__TRIGACT"/>
          <bitfield name="CMD" caption="Software Command" mask="0x3000000" values="DMAC_CHCTRLB__CMD"/>
        </register>
        <register name="CHINTENCLR" offset="0x4C" rw="RW" size="1" atomic-op="clear:CHINTENCLR" initval="0x00" caption="Channel Interrupt Enable Clear">
          <bitfield name="TERR" caption="Channel Transfer Error Interrupt Enable" mask="0x1"/>
          <bitfield name="TCMPL" caption="Channel Transfer Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="SUSP" caption="Channel Suspend Interrupt Enable" mask="0x4"/>
        </register>
        <register name="CHINTENSET" offset="0x4D" rw="RW" size="1" atomic-op="set:CHINTENSET" initval="0x00" caption="Channel Interrupt Enable Set">
          <bitfield name="TERR" caption="Channel Transfer Error Interrupt Enable" mask="0x1"/>
          <bitfield name="TCMPL" caption="Channel Transfer Complete Interrupt Enable" mask="0x2"/>
          <bitfield name="SUSP" caption="Channel Suspend Interrupt Enable" mask="0x4"/>
        </register>
        <register name="CHINTFLAG" offset="0x4E" rw="RW" size="1" atomic-op="clear:CHINTFLAG" initval="0x00" caption="Channel Interrupt Flag Status and Clear">
          <bitfield name="TERR" caption="Channel Transfer Error" mask="0x1"/>
          <bitfield name="TCMPL" caption="Channel Transfer Complete" mask="0x2"/>
          <bitfield name="SUSP" caption="Channel Suspend" mask="0x4"/>
        </register>
        <register name="CHSTATUS" offset="0x4F" rw="R" size="1" initval="0x00" caption="Channel Status">
          <bitfield name="PEND" caption="Channel Pending" mask="0x1"/>
          <bitfield name="BUSY" caption="Channel Busy" mask="0x2"/>
          <bitfield name="FERR" caption="Channel Fetch Error" mask="0x4"/>
        </register>
      </register-group>
