alibaba/AliOS-Things/platform/mcu/atsaml21/saml21b/atdf/ATSAML21E17B.atdf
        <register name="DBGCTRL" offset="0xE" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Run During Debug" mask="0x1"/>
        </register>
        <register modes="MODE0" name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="MODE0 Synchronization Busy Status">
          <bitfield name="SWRST" caption="Software Reset Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Bit Busy" mask="0x2"/>
          <bitfield name="FREQCORR" caption="FREQCORR Register Busy" mask="0x4"/>
          <bitfield name="COUNT" caption="COUNT Register Busy" mask="0x8"/>
          <bitfield name="COMP0" caption="COMP 0 Register Busy" mask="0x20"/>
          <bitfield name="COUNTSYNC" caption="Count Read Synchronization Enable Bit Busy" mask="0x8000"/>
        </register>
        <register modes="MODE1" name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="MODE1 Synchronization Busy Status">
          <bitfield name="SWRST" caption="Software Reset Bit Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Bit Busy" mask="0x2"/>
          <bitfield name="FREQCORR" caption="FREQCORR Register Busy" mask="0x4"/>
          <bitfield name="COUNT" caption="COUNT Register Busy" mask="0x8"/>
          <bitfield name="PER" caption="PER Register Busy" mask="0x10"/>
          <bitfield name="COMP0" caption="COMP 0 Register Busy" mask="0x20"/>
          <bitfield name="COMP1" caption="COMP 1 Register Busy" mask="0x40"/>
          <bitfield name="COUNTSYNC" caption="Count Read Synchronization Enable Bit Busy" mask="0x8000"/>
        </register>
        <register modes="MODE2" name="SYNCBUSY" offset="0x10" rw="R" size="4" initval="0x00000000" caption="MODE2 Synchronization Busy Status">
          <bitfield name="SWRST" caption="Software Reset Bit Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Bit Busy" mask="0x2"/>
          <bitfield name="FREQCORR" caption="FREQCORR Register Busy" mask="0x4"/>
          <bitfield name="CLOCK" caption="CLOCK Register Busy" mask="0x8"/>
          <bitfield name="ALARM0" caption="ALARM 0 Register Busy" mask="0x20"/>
          <bitfield name="MASK0" caption="MASK 0 Register Busy" mask="0x800"/>
          <bitfield name="CLOCKSYNC" caption="Clock Read Synchronization Enable Bit Busy" mask="0x8000"/>
        </register>
        <register name="FREQCORR" offset="0x14" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Frequency Correction">
          <bitfield name="VALUE" caption="Correction Value" mask="0x7F"/>
          <bitfield name="SIGN" caption="Correction Sign" mask="0x80"/>
        </register>
        <register modes="MODE0" name="COUNT" offset="0x18" rw="RW" access="RSYNC" size="4" initval="0x00000000" caption="MODE0 Counter Value">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="MODE1" name="COUNT" offset="0x18" rw="RW" access="RSYNC" size="2" initval="0x0000" caption="MODE1 Counter Value">
          <bitfield name="COUNT" caption="Counter Value" mask="0xFFFF"/>
        </register>
        <register modes="MODE2" name="CLOCK" offset="0x18" rw="RW" access="RSYNC" size="4" initval="0x00000000" caption="MODE2 Clock Value">
          <bitfield name="SECOND" caption="Second" mask="0x3F"/>
          <bitfield name="MINUTE" caption="Minute" mask="0xFC0"/>
          <bitfield name="HOUR" caption="Hour" mask="0x1F000" values="RTC_MODE2_CLOCK__HOUR"/>
          <bitfield name="DAY" caption="Day" mask="0x3E0000"/>
          <bitfield name="MONTH" caption="Month" mask="0x3C00000"/>
          <bitfield name="YEAR" caption="Year" mask="0xFC000000"/>
        </register>
        <register modes="MODE1" name="PER" offset="0x1C" rw="RW" access="WSYNC" size="2" initval="0x0000" caption="MODE1 Counter Period">
          <bitfield name="PER" caption="Counter Period" mask="0xFFFF"/>
        </register>
        <register modes="MODE0" name="COMP" offset="0x20" rw="RW" access="WSYNC" size="4" count="1" initval="0x00000000" caption="MODE0 Compare n Value">
          <bitfield name="COMP" caption="Compare Value" mask="0xFFFFFFFF"/>
        </register>
        <register modes="MODE1" name="COMP" offset="0x20" rw="RW" access="WSYNC" size="2" count="2" initval="0x0000" caption="MODE1 Compare n Value">
          <bitfield name="COMP" caption="Compare Value" mask="0xFFFF"/>
        </register>
        <register-group modes="MODE2" name="MODE2_ALARM" name-in-module="MODE2_ALARM" offset="0x20" count="1"/>
        <register name="GP" offset="0x40" rw="RW" size="4" count="4" initval="0x00000000" caption="General Purpose">
        </register>
      </register-group>
      <value-group name="RTC_MODE0_CTRLA__MODE">
        <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0x0"/>
        <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="0x1"/>
        <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="0x2"/>
      </value-group>
      <value-group name="RTC_MODE0_CTRLA__PRESCALER">
        <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
        <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x1"/>
        <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x2"/>
        <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x3"/>
        <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x4"/>
        <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x5"/>
        <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x6"/>
        <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x7"/>
        <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x8"/>
        <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x9"/>
        <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
        <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
      </value-group>
      <value-group name="RTC_MODE1_CTRLA__MODE">
        <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0"/>
        <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="1"/>
        <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="2"/>
      </value-group>
      <value-group name="RTC_MODE1_CTRLA__PRESCALER">
        <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0"/>
        <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="1"/>
        <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="2"/>
        <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="3"/>
        <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="4"/>
        <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="5"/>
        <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="6"/>
        <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="7"/>
        <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="8"/>
        <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="9"/>
        <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
        <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
      </value-group>
      <value-group name="RTC_MODE2_CTRLA__MODE">
        <value name="COUNT32" caption="Mode 0: 32-bit Counter" value="0"/>
        <value name="COUNT16" caption="Mode 1: 16-bit Counter" value="1"/>
        <value name="CLOCK" caption="Mode 2: Clock/Calendar" value="2"/>
      </value-group>
      <value-group name="RTC_MODE2_CTRLA__PRESCALER">
        <value name="OFF" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x0"/>
        <value name="DIV1" caption="CLK_RTC_CNT = GCLK_RTC/1" value="0x1"/>
        <value name="DIV2" caption="CLK_RTC_CNT = GCLK_RTC/2" value="0x2"/>
        <value name="DIV4" caption="CLK_RTC_CNT = GCLK_RTC/4" value="0x3"/>
        <value name="DIV8" caption="CLK_RTC_CNT = GCLK_RTC/8" value="0x4"/>
        <value name="DIV16" caption="CLK_RTC_CNT = GCLK_RTC/16" value="0x5"/>
        <value name="DIV32" caption="CLK_RTC_CNT = GCLK_RTC/32" value="0x6"/>
        <value name="DIV64" caption="CLK_RTC_CNT = GCLK_RTC/64" value="0x7"/>
        <value name="DIV128" caption="CLK_RTC_CNT = GCLK_RTC/128" value="0x8"/>
        <value name="DIV256" caption="CLK_RTC_CNT = GCLK_RTC/256" value="0x9"/>
        <value name="DIV512" caption="CLK_RTC_CNT = GCLK_RTC/512" value="0xA"/>
        <value name="DIV1024" caption="CLK_RTC_CNT = GCLK_RTC/1024" value="0xB"/>
      </value-group>
      <value-group name="RTC_MODE2_CLOCK__HOUR">
        <value name="AM" caption="AM when CLKREP in 12-hour" value="0x00"/>
        <value name="PM" caption="PM when CLKREP in 12-hour" value="0x10"/>
      </value-group>
      <value-group name="RTC_MODE2_ALARM_ALARM__HOUR">
        <value name="AM" caption="Morning hour" value="0x00"/>
        <value name="PM" caption="Afternoon hour" value="0x10"/>
      </value-group>
      <value-group name="RTC_MODE2_ALARM_MASK__SEL">
        <value name="OFF" caption="Alarm Disabled" value="0x0"/>
        <value name="SS" caption="Match seconds only" value="0x1"/>
        <value name="MMSS" caption="Match seconds and minutes only" value="0x2"/>
        <value name="HHMMSS" caption="Match seconds, minutes, and hours only" value="0x3"/>
        <value name="DDHHMMSS" caption="Match seconds, minutes, hours, and days only" value="0x4"/>
        <value name="MMDDHHMMSS" caption="Match seconds, minutes, hours, days, and months only" value="0x5"/>
        <value name="YYMMDDHHMMSS" caption="Match seconds, minutes, hours, days, months, and years" value="0x6"/>
      </value-group>
    </module>
    <module name="SERCOM" id="U2201" version="2.2.0" caption="Serial Communication Interface">
      <register-group name="SERCOM" caption="Serial Communication Interface">
        <mode name="I2CM" qualifier="SERCOM.I2CM_CTRLA.MODE" value="5" caption="I2C Master Mode"/>
        <mode name="I2CS" qualifier="SERCOM.I2CS_CTRLA.MODE" value="4" caption="I2C Slave Mode"/>
        <mode name="SPI" qualifier="SERCOM.SPI_CTRLA.MODE" mask="6" value="2" caption="SPI Mode"/>
        <mode name="USART" qualifier="SERCOM.USART_CTRLA.MODE" mask="6" value="0" caption="USART Mode"/>
        <register modes="I2CM" name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="I2CM Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x80"/>
          <bitfield name="PINOUT" caption="Pin Usage" mask="0x10000"/>
          <bitfield name="SDAHOLD" caption="SDA Hold Time" mask="0x300000"/>
          <bitfield name="MEXTTOEN" caption="Master SCL Low Extend Timeout" mask="0x400000"/>
          <bitfield name="SEXTTOEN" caption="Slave SCL Low Extend Timeout" mask="0x800000"/>
          <bitfield name="SPEED" caption="Transfer Speed" mask="0x3000000"/>
          <bitfield name="SCLSM" caption="SCL Clock Stretch Mode" mask="0x8000000"/>
          <bitfield name="INACTOUT" caption="Inactive Time-Out" mask="0x30000000"/>
          <bitfield name="LOWTOUTEN" caption="SCL Low Timeout Enable" mask="0x40000000"/>
        </register>
        <register modes="I2CS" name="CTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="I2CS Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="MODE" caption="Operating Mode" mask="0x1C"/>
          <bitfield name="RUNSTDBY" caption="Run during Standby" mask="0x80"/>
          <bitfield name="PINOUT" caption="Pin Usage" mask="0x10000"/>
          <bitfield name="SDAHOLD" caption="SDA Hold Time" mask="0x300000"/>
          <bitfield name="SEXTTOEN" caption="Slave SCL Low Extend Timeout" mask="0x800000"/>
          <bitfield name="SPEED" caption="Transfer Speed" mask="0x3000000"/>
          <bitfield name="SCLSM" caption="SCL Clock Stretch Mode" mask="0x8000000"/>
          <bitfield name="LOWTOUTEN" caption="SCL Low Timeout Enable" mask="0x40000000"/>
        </register>
